Revit 2026 API

# BoundaryConditionsGetCurve Method

---

Returns curve that define geometry of the line boundary conditions.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Curve GetCurve()
```
```vb
Public Function GetCurve As Curve
```
```cpp
public:
Curve^ GetCurve()
```
```fsharp
member GetCurve : unit -> Curve
```

#### Return Value

Curve

| Exception | Condition |
| --- | --- |
| InvalidObjectException | Thrown when BoundaryConditions is not a BoundaryConditionsType::Line type. |

Boundary conditions should be BoundaryConditionsType::Line type. Otherwise exception is thrown.

#### Reference

BoundaryConditions Class

Autodesk.Revit.DB.Structure Namespace